[
  {
    "id": 1,
    "role": "attacker",
    "situation": {
      "en": "You want to gain access to a company's internal system. What do you do first?",
      "fr": "Vous voulez accéder au système interne d'une entreprise. Que faites-vous en premier ?"
    },
    "choices": [
      {
        "text": {
          "en": "Send a fake LinkedIn message to an employee",
          "fr": "Envoyer un faux message LinkedIn à un employé"
        },
        "outcome": {
          "en": "The employee responds and reveals the team structure. You gain valuable info.",
          "fr": "L'employé répond et révèle la structure de l'équipe. Vous obtenez des informations précieuses."
        }
      },
      {
        "text": {
          "en": "Try to guess the admin password",
          "fr": "Essayer de deviner le mot de passe administrateur"
        },
        "outcome": {
          "en": "Too risky. You're locked out quickly.",
          "fr": "Trop risqué. Vous êtes rapidement bloqué."
        }
      }
    ]
  },
  {
    "id": 2,
    "role": "defender",
    "situation": {
      "en": "You receive a call from 'IT support' asking for your credentials.",
      "fr": "Vous recevez un appel du 'support informatique' demandant vos identifiants."
    },
    "choices": [
      {
        "text": {
          "en": "Ask them to verify their identity",
          "fr": "Demander de vérifier leur identité"
        },
        "outcome": {
          "en": "They hang up — good job! It was a phishing call.",
          "fr": "Ils raccrochent — bien joué ! C'était un appel de phishing."
        }
      },
      {
        "text": {
          "en": "Give them your login info",
          "fr": "Donner vos identifiants de connexion"
        },
        "outcome": {
          "en": "Oh no! You've been breached.",
          "fr": "Oh non ! Votre compte a été compromis."
        }
      }
    ]
  },
  {
    "id": 3,
    "role": "attacker",
    "situation": {
      "en": "You want to install malware on a target's computer. What is your first step?",
      "fr": "Vous voulez installer un malware sur l'ordinateur d'une cible. Quelle est votre première étape ?"
    },
    "choices": [
      {
        "text": {
          "en": "Send a phishing email with a malicious attachment",
          "fr": "Envoyer un e-mail de phishing avec une pièce jointe malveillante"
        },
        "outcome": {
          "en": "The target opens the attachment, and you gain access to their system.",
          "fr": "La cible ouvre la pièce jointe et vous accédez à son système."
        }
      },
      {
        "text": {
          "en": "Physically access their computer and install it directly",
          "fr": "Accéder physiquement à leur ordinateur et l'installer directement"
        },
        "outcome": {
          "en": "Too risky! You get caught on camera.",
          "fr": "Trop risqué ! Vous êtes filmé par une caméra."
        }
      }
    ]
  },
  {
    "id": 4,
    "role": "defender",
    "situation": {
      "en": "You notice a suspicious USB drive left in the office. What do you do?",
      "fr": "Vous remarquez une clé USB suspecte laissée dans le bureau. Que faites-vous ?"
    },
    "choices": [
      {
        "text": {
          "en": "Plug it into your computer to see what's on it",
          "fr": "La brancher sur votre ordinateur pour voir ce qu'elle contient"
        },
        "outcome": {
          "en": "You've just infected your system with malware.",
          "fr": "Vous venez d'infecter votre système avec un malware."
        }
      },
      {
        "text": {
          "en": "Report it to IT without touching it",
          "fr": "La signaler à l'informatique sans la toucher"
        },
        "outcome": {
          "en": "Good choice! IT safely disposes of it.",
          "fr": "Bon choix ! L'informatique s'en débarrasse en toute sécurité."
        }
      }
    ]
  },
  {
    "id": 5,
    "role": "attacker",
    "situation": {
      "en": "You want to gather information about a company's employees. What do you do?",
      "fr": "Vous voulez collecter des informations sur les employés d'une entreprise. Que faites-vous ?"
    },
    "choices": [
      {
        "text": {
          "en": "Create a fake company website and collect data through a form",
          "fr": "Créer un faux site web d'entreprise et collecter des données via un formulaire"
        },
        "outcome": {
          "en": "You gather personal information from unsuspecting employees.",
          "fr": "Vous collectez des informations personnelles d'employés non méfiants."
        }
      },
      {
        "text": {
          "en": "Search for information on public social media profiles",
          "fr": "Chercher des informations sur des profils publics de réseaux sociaux"
        },
        "outcome": {
          "en": "You find some info, but it's not as detailed.",
          "fr": "Vous trouvez quelques informations, mais elles ne sont pas très détaillées."
        }
      }
    ]
  },
  {
    "id": 6,
    "role": "defender",
    "situation": {
      "en": "You receive an email with a link to a supposed company survey. What should you do?",
      "fr": "Vous recevez un e-mail avec un lien vers un soi-disant sondage de l'entreprise. Que devez-vous faire ?"
    },
    "choices": [
      {
        "text": {
          "en": "Click the link and complete the survey",
          "fr": "Cliquer sur le lien et remplir le sondage"
        },
        "outcome": {
          "en": "You've just given away your credentials to a phishing site.",
          "fr": "Vous venez de donner vos identifiants à un site de phishing."
        }
      },
      {
        "text": {
          "en": "Verify the email sender and check with your manager",
          "fr": "Vérifier l'expéditeur de l'e-mail et consulter votre manager"
        },
        "outcome": {
          "en": "Smart move! The email was a phishing attempt.",
          "fr": "Bonne décision ! L'e-mail était une tentative de phishing."
        }
      }
    ]
  },
  {
    "id": 7,
    "role": "attacker",
    "situation": {
      "en": "You want to impersonate an employee to gain access to sensitive information. What do you do?",
      "fr": "Vous voulez usurper l'identité d'un employé pour accéder à des informations sensibles. Que faites-vous ?"
    },
    "choices": [
      {
        "text": {
          "en": "Call the help desk pretending to be that employee",
          "fr": "Appeler le support technique en prétendant être cet employé"
        },
        "outcome": {
          "en": "You successfully reset their password and gain access.",
          "fr": "Vous réussissez à réinitialiser leur mot de passe et obtenez l'accès."
        }
      },
      {
        "text": {
          "en": "Send an email from a spoofed address",
          "fr": "Envoyer un e-mail depuis une adresse usurpée"
        },
        "outcome": {
          "en": "The email gets flagged as suspicious.",
          "fr": "L'e-mail est signalé comme suspect."
        }
      }
    ]
  },
  {
    "id": 8,
    "role": "defender",
    "situation": {
      "en": "A colleague asks you to share your login credentials for a project. What do you do?",
      "fr": "Un collègue vous demande de partager vos identifiants pour un projet. Que faites-vous ?"
    },
    "choices": [
      {
        "text": {
          "en": "Share your credentials to help them out",
          "fr": "Partager vos identifiants pour l'aider"
        },
        "outcome": {
          "en": "You've compromised your account and the company's security.",
          "fr": "Vous avez compromis votre compte et la sécurité de l'entreprise."
        }
      },
      {
        "text": {
          "en": "Politely refuse and suggest they use their own account",
          "fr": "Refuser poliment et suggérer d'utiliser son propre compte"
        },
        "outcome": {
          "en": "Great job! You maintained security protocols.",
          "fr": "Très bien ! Vous avez respecté les protocoles de sécurité."
        }
      }
    ]
  },
  {
    "id": 9,
    "role": "attacker",
    "situation": {
      "en": "You want to exploit a vulnerability in a company's software. What is your approach?",
      "fr": "Vous voulez exploiter une vulnérabilité dans le logiciel d'une entreprise. Quelle est votre approche ?"
    },
    "choices": [
      {
        "text": {
          "en": "Research online for known vulnerabilities and exploit them",
          "fr": "Rechercher en ligne des vulnérabilités connues et les exploiter"
        },
        "outcome": {
          "en": "You successfully breach the system.",
          "fr": "Vous réussissez à pénétrer dans le système."
        }
      },
      {
        "text": {
          "en": "Attempt to brute-force the software's login",
          "fr": "Tenter de forcer par bruteforce la connexion du logiciel"
        },
        "outcome": {
          "en": "You trigger security alerts and get locked out.",
          "fr": "Vous déclenchez des alertes de sécurité et êtes bloqué."
        }
      }
    ]
  },
  {
    "id": 10,
    "role": "defender",
    "situation": {
      "en": "You receive a text message from an unknown number claiming to be from your bank. What do you do?",
      "fr": "Vous recevez un SMS d'un numéro inconnu prétendant venir de votre banque. Que faites-vous ?"
    },
    "choices": [
      {
        "text": {
          "en": "Respond with your account details to verify",
          "fr": "Répondre avec vos informations de compte pour vérifier"
        },
        "outcome": {
          "en": "You've just fallen for a scam.",
          "fr": "Vous venez de tomber dans une arnaque."
        }
      },
      {
        "text": {
          "en": "Contact your bank directly using official channels",
          "fr": "Contacter directement votre banque via les canaux officiels"
        },
        "outcome": {
          "en": "Well done! You avoided a potential scam.",
          "fr": "Bien joué ! Vous avez évité une arnaque potentielle."
        }
      }
    ]
  }
]
